Loss: 0.629
Accuracy: 0.804
F1[A]: 0.7105263157894736
F1[~]: 0.48235294117647054
F1[N]: 0.8812527185732928
F1[O]: 0.7316267547481421
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_51 (Conv1D)           (None, 8996, 32)          192       
_________________________________________________________________
activation_51 (Activation)   (None, 8996, 32)          0         
_________________________________________________________________
batch_normalization_51 (Batc (None, 8996, 32)          128       
_________________________________________________________________
max_pooling1d_46 (MaxPooling (None, 4498, 32)          0         
_________________________________________________________________
conv1d_52 (Conv1D)           (None, 4494, 32)          5152      
_________________________________________________________________
activation_52 (Activation)   (None, 4494, 32)          0         
_________________________________________________________________
batch_normalization_52 (Batc (None, 4494, 32)          128       
_________________________________________________________________
max_pooling1d_47 (MaxPooling (None, 2247, 32)          0         
_________________________________________________________________
conv1d_53 (Conv1D)           (None, 2243, 64)          10304     
_________________________________________________________________
activation_53 (Activation)   (None, 2243, 64)          0         
_________________________________________________________________
batch_normalization_53 (Batc (None, 2243, 64)          256       
_________________________________________________________________
max_pooling1d_48 (MaxPooling (None, 1121, 64)          0         
_________________________________________________________________
conv1d_54 (Conv1D)           (None, 1117, 64)          20544     
_________________________________________________________________
activation_54 (Activation)   (None, 1117, 64)          0         
_________________________________________________________________
batch_normalization_54 (Batc (None, 1117, 64)          256       
_________________________________________________________________
max_pooling1d_49 (MaxPooling (None, 558, 64)           0         
_________________________________________________________________
conv1d_55 (Conv1D)           (None, 554, 128)          41088     
_________________________________________________________________
activation_55 (Activation)   (None, 554, 128)          0         
_________________________________________________________________
batch_normalization_55 (Batc (None, 554, 128)          512       
_________________________________________________________________
max_pooling1d_50 (MaxPooling (None, 277, 128)          0         
_________________________________________________________________
conv1d_56 (Conv1D)           (None, 273, 128)          82048     
_________________________________________________________________
activation_56 (Activation)   (None, 273, 128)          0         
_________________________________________________________________
batch_normalization_56 (Batc (None, 273, 128)          512       
_________________________________________________________________
max_pooling1d_51 (MaxPooling (None, 136, 128)          0         
_________________________________________________________________
dropout_21 (Dropout)         (None, 136, 128)          0         
_________________________________________________________________
conv1d_57 (Conv1D)           (None, 132, 256)          164096    
_________________________________________________________________
activation_57 (Activation)   (None, 132, 256)          0         
_________________________________________________________________
batch_normalization_57 (Batc (None, 132, 256)          1024      
_________________________________________________________________
max_pooling1d_52 (MaxPooling (None, 66, 256)           0         
_________________________________________________________________
conv1d_58 (Conv1D)           (None, 62, 256)           327936    
_________________________________________________________________
activation_58 (Activation)   (None, 62, 256)           0         
_________________________________________________________________
batch_normalization_58 (Batc (None, 62, 256)           1024      
_________________________________________________________________
max_pooling1d_53 (MaxPooling (None, 31, 256)           0         
_________________________________________________________________
dropout_22 (Dropout)         (None, 31, 256)           0         
_________________________________________________________________
conv1d_59 (Conv1D)           (None, 27, 512)           655872    
_________________________________________________________________
activation_59 (Activation)   (None, 27, 512)           0         
_________________________________________________________________
batch_normalization_59 (Batc (None, 27, 512)           2048      
_________________________________________________________________
max_pooling1d_54 (MaxPooling (None, 13, 512)           0         
_________________________________________________________________
dropout_23 (Dropout)         (None, 13, 512)           0         
_________________________________________________________________
conv1d_60 (Conv1D)           (None, 9, 512)            1311232   
_________________________________________________________________
activation_60 (Activation)   (None, 9, 512)            0         
_________________________________________________________________
batch_normalization_60 (Batc (None, 9, 512)            2048      
_________________________________________________________________
flatten_6 (Flatten)          (None, 4608)              0         
_________________________________________________________________
dense_16 (Dense)             (None, 128)               589952    
_________________________________________________________________
dropout_24 (Dropout)         (None, 128)               0         
_________________________________________________________________
dense_17 (Dense)             (None, 32)                4128      
_________________________________________________________________
dense_18 (Dense)             (None, 4)                 132       
=================================================================
Total params: 3,220,612
Trainable params: 3,216,644
Non-trainable params: 3,968
_________________________________________________________________
