Loss: 0.670
Accuracy: 0.789
F1[A]: 0.7184466019417475
F1[~]: 0.45581395348837206
F1[N]: 0.8858560794044664
F1[O]: 0.6561576354679803
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_21 (Conv1D)           (None, 8996, 32)          192       
_________________________________________________________________
activation_21 (Activation)   (None, 8996, 32)          0         
_________________________________________________________________
batch_normalization_21 (Batc (None, 8996, 32)          128       
_________________________________________________________________
max_pooling1d_19 (MaxPooling (None, 4498, 32)          0         
_________________________________________________________________
conv1d_22 (Conv1D)           (None, 4494, 32)          5152      
_________________________________________________________________
activation_22 (Activation)   (None, 4494, 32)          0         
_________________________________________________________________
batch_normalization_22 (Batc (None, 4494, 32)          128       
_________________________________________________________________
max_pooling1d_20 (MaxPooling (None, 2247, 32)          0         
_________________________________________________________________
conv1d_23 (Conv1D)           (None, 2243, 64)          10304     
_________________________________________________________________
activation_23 (Activation)   (None, 2243, 64)          0         
_________________________________________________________________
batch_normalization_23 (Batc (None, 2243, 64)          256       
_________________________________________________________________
max_pooling1d_21 (MaxPooling (None, 1121, 64)          0         
_________________________________________________________________
conv1d_24 (Conv1D)           (None, 1117, 64)          20544     
_________________________________________________________________
activation_24 (Activation)   (None, 1117, 64)          0         
_________________________________________________________________
batch_normalization_24 (Batc (None, 1117, 64)          256       
_________________________________________________________________
max_pooling1d_22 (MaxPooling (None, 558, 64)           0         
_________________________________________________________________
conv1d_25 (Conv1D)           (None, 554, 128)          41088     
_________________________________________________________________
activation_25 (Activation)   (None, 554, 128)          0         
_________________________________________________________________
batch_normalization_25 (Batc (None, 554, 128)          512       
_________________________________________________________________
max_pooling1d_23 (MaxPooling (None, 277, 128)          0         
_________________________________________________________________
conv1d_26 (Conv1D)           (None, 273, 128)          82048     
_________________________________________________________________
activation_26 (Activation)   (None, 273, 128)          0         
_________________________________________________________________
batch_normalization_26 (Batc (None, 273, 128)          512       
_________________________________________________________________
max_pooling1d_24 (MaxPooling (None, 136, 128)          0         
_________________________________________________________________
dropout_9 (Dropout)          (None, 136, 128)          0         
_________________________________________________________________
conv1d_27 (Conv1D)           (None, 132, 256)          164096    
_________________________________________________________________
activation_27 (Activation)   (None, 132, 256)          0         
_________________________________________________________________
batch_normalization_27 (Batc (None, 132, 256)          1024      
_________________________________________________________________
max_pooling1d_25 (MaxPooling (None, 66, 256)           0         
_________________________________________________________________
conv1d_28 (Conv1D)           (None, 62, 256)           327936    
_________________________________________________________________
activation_28 (Activation)   (None, 62, 256)           0         
_________________________________________________________________
batch_normalization_28 (Batc (None, 62, 256)           1024      
_________________________________________________________________
max_pooling1d_26 (MaxPooling (None, 31, 256)           0         
_________________________________________________________________
dropout_10 (Dropout)         (None, 31, 256)           0         
_________________________________________________________________
conv1d_29 (Conv1D)           (None, 27, 512)           655872    
_________________________________________________________________
activation_29 (Activation)   (None, 27, 512)           0         
_________________________________________________________________
batch_normalization_29 (Batc (None, 27, 512)           2048      
_________________________________________________________________
max_pooling1d_27 (MaxPooling (None, 13, 512)           0         
_________________________________________________________________
dropout_11 (Dropout)         (None, 13, 512)           0         
_________________________________________________________________
conv1d_30 (Conv1D)           (None, 9, 512)            1311232   
_________________________________________________________________
activation_30 (Activation)   (None, 9, 512)            0         
_________________________________________________________________
batch_normalization_30 (Batc (None, 9, 512)            2048      
_________________________________________________________________
flatten_3 (Flatten)          (None, 4608)              0         
_________________________________________________________________
dense_7 (Dense)              (None, 128)               589952    
_________________________________________________________________
dropout_12 (Dropout)         (None, 128)               0         
_________________________________________________________________
dense_8 (Dense)              (None, 32)                4128      
_________________________________________________________________
dense_9 (Dense)              (None, 4)                 132       
=================================================================
Total params: 3,220,612
Trainable params: 3,216,644
Non-trainable params: 3,968
_________________________________________________________________
