Loss: 0.101
Accuracy: 0.969
F1[A]: 0.9837837837837837
F1[~]: 0.9375
F1[N]: 0.9772256728778467
F1[O]: 0.9503051438535308
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_1 (Conv1D)            (None, 8994, 32)          256       
_________________________________________________________________
batch_normalization_1 (Batch (None, 8994, 32)          128       
_________________________________________________________________
activation_1 (Activation)    (None, 8994, 32)          0         
_________________________________________________________________
max_pooling1d_1 (MaxPooling1 (None, 4497, 32)          0         
_________________________________________________________________
conv1d_2 (Conv1D)            (None, 4491, 32)          7200      
_________________________________________________________________
batch_normalization_2 (Batch (None, 4491, 32)          128       
_________________________________________________________________
activation_2 (Activation)    (None, 4491, 32)          0         
_________________________________________________________________
max_pooling1d_2 (MaxPooling1 (None, 2245, 32)          0         
_________________________________________________________________
conv1d_3 (Conv1D)            (None, 2239, 64)          14400     
_________________________________________________________________
batch_normalization_3 (Batch (None, 2239, 64)          256       
_________________________________________________________________
activation_3 (Activation)    (None, 2239, 64)          0         
_________________________________________________________________
max_pooling1d_3 (MaxPooling1 (None, 1119, 64)          0         
_________________________________________________________________
conv1d_4 (Conv1D)            (None, 1113, 64)          28736     
_________________________________________________________________
batch_normalization_4 (Batch (None, 1113, 64)          256       
_________________________________________________________________
activation_4 (Activation)    (None, 1113, 64)          0         
_________________________________________________________________
max_pooling1d_4 (MaxPooling1 (None, 556, 64)           0         
_________________________________________________________________
conv1d_5 (Conv1D)            (None, 550, 128)          57472     
_________________________________________________________________
batch_normalization_5 (Batch (None, 550, 128)          512       
_________________________________________________________________
activation_5 (Activation)    (None, 550, 128)          0         
_________________________________________________________________
max_pooling1d_5 (MaxPooling1 (None, 275, 128)          0         
_________________________________________________________________
conv1d_6 (Conv1D)            (None, 269, 128)          114816    
_________________________________________________________________
batch_normalization_6 (Batch (None, 269, 128)          512       
_________________________________________________________________
activation_6 (Activation)    (None, 269, 128)          0         
_________________________________________________________________
max_pooling1d_6 (MaxPooling1 (None, 134, 128)          0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 134, 128)          0         
_________________________________________________________________
conv1d_7 (Conv1D)            (None, 128, 256)          229632    
_________________________________________________________________
batch_normalization_7 (Batch (None, 128, 256)          1024      
_________________________________________________________________
activation_7 (Activation)    (None, 128, 256)          0         
_________________________________________________________________
max_pooling1d_7 (MaxPooling1 (None, 64, 256)           0         
_________________________________________________________________
conv1d_8 (Conv1D)            (None, 58, 256)           459008    
_________________________________________________________________
batch_normalization_8 (Batch (None, 58, 256)           1024      
_________________________________________________________________
activation_8 (Activation)    (None, 58, 256)           0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 14848)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 128)               1900672   
_________________________________________________________________
dropout_2 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 32)                4128      
_________________________________________________________________
dense_3 (Dense)              (None, 4)                 132       
=================================================================
Total params: 2,820,292
Trainable params: 2,818,372
Non-trainable params: 1,920
_________________________________________________________________
