Loss: 0.576
Accuracy: 0.763
F1[A]: 0.5619834710743803
F1[~]: 0.5695364238410596
F1[N]: 0.8770685579196217
F1[O]: 0.5762376237623762
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_11 (Conv1D)           (None, 8996, 32)          192       
_________________________________________________________________
activation_11 (Activation)   (None, 8996, 32)          0         
_________________________________________________________________
max_pooling1d_10 (MaxPooling (None, 4498, 32)          0         
_________________________________________________________________
conv1d_12 (Conv1D)           (None, 4494, 32)          5152      
_________________________________________________________________
activation_12 (Activation)   (None, 4494, 32)          0         
_________________________________________________________________
max_pooling1d_11 (MaxPooling (None, 2247, 32)          0         
_________________________________________________________________
conv1d_13 (Conv1D)           (None, 2243, 32)          5152      
_________________________________________________________________
activation_13 (Activation)   (None, 2243, 32)          0         
_________________________________________________________________
max_pooling1d_12 (MaxPooling (None, 1121, 32)          0         
_________________________________________________________________
conv1d_14 (Conv1D)           (None, 1117, 32)          5152      
_________________________________________________________________
activation_14 (Activation)   (None, 1117, 32)          0         
_________________________________________________________________
max_pooling1d_13 (MaxPooling (None, 558, 32)           0         
_________________________________________________________________
conv1d_15 (Conv1D)           (None, 554, 32)           5152      
_________________________________________________________________
activation_15 (Activation)   (None, 554, 32)           0         
_________________________________________________________________
max_pooling1d_14 (MaxPooling (None, 277, 32)           0         
_________________________________________________________________
conv1d_16 (Conv1D)           (None, 273, 32)           5152      
_________________________________________________________________
activation_16 (Activation)   (None, 273, 32)           0         
_________________________________________________________________
max_pooling1d_15 (MaxPooling (None, 136, 32)           0         
_________________________________________________________________
dropout_4 (Dropout)          (None, 136, 32)           0         
_________________________________________________________________
conv1d_17 (Conv1D)           (None, 132, 32)           5152      
_________________________________________________________________
activation_17 (Activation)   (None, 132, 32)           0         
_________________________________________________________________
max_pooling1d_16 (MaxPooling (None, 66, 32)            0         
_________________________________________________________________
conv1d_18 (Conv1D)           (None, 62, 32)            5152      
_________________________________________________________________
activation_18 (Activation)   (None, 62, 32)            0         
_________________________________________________________________
max_pooling1d_17 (MaxPooling (None, 31, 32)            0         
_________________________________________________________________
dropout_5 (Dropout)          (None, 31, 32)            0         
_________________________________________________________________
conv1d_19 (Conv1D)           (None, 27, 32)            5152      
_________________________________________________________________
activation_19 (Activation)   (None, 27, 32)            0         
_________________________________________________________________
max_pooling1d_18 (MaxPooling (None, 13, 32)            0         
_________________________________________________________________
dropout_6 (Dropout)          (None, 13, 32)            0         
_________________________________________________________________
conv1d_20 (Conv1D)           (None, 9, 32)             5152      
_________________________________________________________________
activation_20 (Activation)   (None, 9, 32)             0         
_________________________________________________________________
flatten_2 (Flatten)          (None, 288)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 4)                 1156      
=================================================================
Total params: 47,716
Trainable params: 47,716
Non-trainable params: 0
_________________________________________________________________
