Loss: 0.509
Accuracy: 0.801
F1[A]: 0.7416413373860181
F1[~]: 0.6296296296296297
F1[N]: 0.8779761904761905
F1[O]: 0.6224598930481283
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_31 (Conv1D)           (None, 8996, 32)          192       
_________________________________________________________________
activation_31 (Activation)   (None, 8996, 32)          0         
_________________________________________________________________
max_pooling1d_28 (MaxPooling (None, 4498, 32)          0         
_________________________________________________________________
conv1d_32 (Conv1D)           (None, 4494, 32)          5152      
_________________________________________________________________
activation_32 (Activation)   (None, 4494, 32)          0         
_________________________________________________________________
max_pooling1d_29 (MaxPooling (None, 2247, 32)          0         
_________________________________________________________________
conv1d_33 (Conv1D)           (None, 2243, 32)          5152      
_________________________________________________________________
activation_33 (Activation)   (None, 2243, 32)          0         
_________________________________________________________________
max_pooling1d_30 (MaxPooling (None, 1121, 32)          0         
_________________________________________________________________
conv1d_34 (Conv1D)           (None, 1117, 32)          5152      
_________________________________________________________________
activation_34 (Activation)   (None, 1117, 32)          0         
_________________________________________________________________
max_pooling1d_31 (MaxPooling (None, 558, 32)           0         
_________________________________________________________________
conv1d_35 (Conv1D)           (None, 554, 32)           5152      
_________________________________________________________________
activation_35 (Activation)   (None, 554, 32)           0         
_________________________________________________________________
max_pooling1d_32 (MaxPooling (None, 277, 32)           0         
_________________________________________________________________
conv1d_36 (Conv1D)           (None, 273, 32)           5152      
_________________________________________________________________
activation_36 (Activation)   (None, 273, 32)           0         
_________________________________________________________________
max_pooling1d_33 (MaxPooling (None, 136, 32)           0         
_________________________________________________________________
dropout_10 (Dropout)         (None, 136, 32)           0         
_________________________________________________________________
conv1d_37 (Conv1D)           (None, 132, 32)           5152      
_________________________________________________________________
activation_37 (Activation)   (None, 132, 32)           0         
_________________________________________________________________
max_pooling1d_34 (MaxPooling (None, 66, 32)            0         
_________________________________________________________________
conv1d_38 (Conv1D)           (None, 62, 32)            5152      
_________________________________________________________________
activation_38 (Activation)   (None, 62, 32)            0         
_________________________________________________________________
max_pooling1d_35 (MaxPooling (None, 31, 32)            0         
_________________________________________________________________
dropout_11 (Dropout)         (None, 31, 32)            0         
_________________________________________________________________
conv1d_39 (Conv1D)           (None, 27, 32)            5152      
_________________________________________________________________
activation_39 (Activation)   (None, 27, 32)            0         
_________________________________________________________________
max_pooling1d_36 (MaxPooling (None, 13, 32)            0         
_________________________________________________________________
dropout_12 (Dropout)         (None, 13, 32)            0         
_________________________________________________________________
conv1d_40 (Conv1D)           (None, 9, 32)             5152      
_________________________________________________________________
activation_40 (Activation)   (None, 9, 32)             0         
_________________________________________________________________
flatten_4 (Flatten)          (None, 288)               0         
_________________________________________________________________
dense_4 (Dense)              (None, 4)                 1156      
=================================================================
Total params: 47,716
Trainable params: 47,716
Non-trainable params: 0
_________________________________________________________________
