Loss: 0.562
Accuracy: 0.767
F1[A]: 0.7142857142857143
F1[~]: 0.46258503401360546
F1[N]: 0.8729109988340458
F1[O]: 0.541304347826087
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_41 (Conv1D)           (None, 8996, 32)          192       
_________________________________________________________________
activation_41 (Activation)   (None, 8996, 32)          0         
_________________________________________________________________
max_pooling1d_37 (MaxPooling (None, 4498, 32)          0         
_________________________________________________________________
conv1d_42 (Conv1D)           (None, 4494, 32)          5152      
_________________________________________________________________
activation_42 (Activation)   (None, 4494, 32)          0         
_________________________________________________________________
max_pooling1d_38 (MaxPooling (None, 2247, 32)          0         
_________________________________________________________________
conv1d_43 (Conv1D)           (None, 2243, 32)          5152      
_________________________________________________________________
activation_43 (Activation)   (None, 2243, 32)          0         
_________________________________________________________________
max_pooling1d_39 (MaxPooling (None, 1121, 32)          0         
_________________________________________________________________
conv1d_44 (Conv1D)           (None, 1117, 32)          5152      
_________________________________________________________________
activation_44 (Activation)   (None, 1117, 32)          0         
_________________________________________________________________
max_pooling1d_40 (MaxPooling (None, 558, 32)           0         
_________________________________________________________________
conv1d_45 (Conv1D)           (None, 554, 32)           5152      
_________________________________________________________________
activation_45 (Activation)   (None, 554, 32)           0         
_________________________________________________________________
max_pooling1d_41 (MaxPooling (None, 277, 32)           0         
_________________________________________________________________
conv1d_46 (Conv1D)           (None, 273, 32)           5152      
_________________________________________________________________
activation_46 (Activation)   (None, 273, 32)           0         
_________________________________________________________________
max_pooling1d_42 (MaxPooling (None, 136, 32)           0         
_________________________________________________________________
dropout_13 (Dropout)         (None, 136, 32)           0         
_________________________________________________________________
conv1d_47 (Conv1D)           (None, 132, 32)           5152      
_________________________________________________________________
activation_47 (Activation)   (None, 132, 32)           0         
_________________________________________________________________
max_pooling1d_43 (MaxPooling (None, 66, 32)            0         
_________________________________________________________________
conv1d_48 (Conv1D)           (None, 62, 32)            5152      
_________________________________________________________________
activation_48 (Activation)   (None, 62, 32)            0         
_________________________________________________________________
max_pooling1d_44 (MaxPooling (None, 31, 32)            0         
_________________________________________________________________
dropout_14 (Dropout)         (None, 31, 32)            0         
_________________________________________________________________
conv1d_49 (Conv1D)           (None, 27, 32)            5152      
_________________________________________________________________
activation_49 (Activation)   (None, 27, 32)            0         
_________________________________________________________________
max_pooling1d_45 (MaxPooling (None, 13, 32)            0         
_________________________________________________________________
dropout_15 (Dropout)         (None, 13, 32)            0         
_________________________________________________________________
conv1d_50 (Conv1D)           (None, 9, 32)             5152      
_________________________________________________________________
activation_50 (Activation)   (None, 9, 32)             0         
_________________________________________________________________
flatten_5 (Flatten)          (None, 288)               0         
_________________________________________________________________
dense_5 (Dense)              (None, 4)                 1156      
=================================================================
Total params: 47,716
Trainable params: 47,716
Non-trainable params: 0
_________________________________________________________________
