Loss: 0.534
Accuracy: 0.832
F1[A]: 0.7979274611398963
F1[~]: 0.6093750000000001
F1[N]: 0.8930659983291562
F1[O]: 0.7413194444444444
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_21 (Conv1D)           (None, 8996, 32)          192       
_________________________________________________________________
activation_21 (Activation)   (None, 8996, 32)          0         
_________________________________________________________________
batch_normalization_3 (Batch (None, 8996, 32)          128       
_________________________________________________________________
average_pooling1d_21 (Averag (None, 4498, 32)          0         
_________________________________________________________________
conv1d_22 (Conv1D)           (None, 4494, 32)          5152      
_________________________________________________________________
activation_22 (Activation)   (None, 4494, 32)          0         
_________________________________________________________________
average_pooling1d_22 (Averag (None, 2247, 32)          0         
_________________________________________________________________
conv1d_23 (Conv1D)           (None, 2243, 64)          10304     
_________________________________________________________________
activation_23 (Activation)   (None, 2243, 64)          0         
_________________________________________________________________
average_pooling1d_23 (Averag (None, 1121, 64)          0         
_________________________________________________________________
conv1d_24 (Conv1D)           (None, 1117, 64)          20544     
_________________________________________________________________
activation_24 (Activation)   (None, 1117, 64)          0         
_________________________________________________________________
average_pooling1d_24 (Averag (None, 558, 64)           0         
_________________________________________________________________
conv1d_25 (Conv1D)           (None, 554, 128)          41088     
_________________________________________________________________
activation_25 (Activation)   (None, 554, 128)          0         
_________________________________________________________________
average_pooling1d_25 (Averag (None, 277, 128)          0         
_________________________________________________________________
conv1d_26 (Conv1D)           (None, 273, 128)          82048     
_________________________________________________________________
activation_26 (Activation)   (None, 273, 128)          0         
_________________________________________________________________
average_pooling1d_26 (Averag (None, 136, 128)          0         
_________________________________________________________________
dropout_9 (Dropout)          (None, 136, 128)          0         
_________________________________________________________________
conv1d_27 (Conv1D)           (None, 132, 256)          164096    
_________________________________________________________________
activation_27 (Activation)   (None, 132, 256)          0         
_________________________________________________________________
average_pooling1d_27 (Averag (None, 66, 256)           0         
_________________________________________________________________
conv1d_28 (Conv1D)           (None, 62, 256)           327936    
_________________________________________________________________
activation_28 (Activation)   (None, 62, 256)           0         
_________________________________________________________________
average_pooling1d_28 (Averag (None, 31, 256)           0         
_________________________________________________________________
dropout_10 (Dropout)         (None, 31, 256)           0         
_________________________________________________________________
conv1d_29 (Conv1D)           (None, 27, 512)           655872    
_________________________________________________________________
activation_29 (Activation)   (None, 27, 512)           0         
_________________________________________________________________
average_pooling1d_29 (Averag (None, 13, 512)           0         
_________________________________________________________________
dropout_11 (Dropout)         (None, 13, 512)           0         
_________________________________________________________________
conv1d_30 (Conv1D)           (None, 9, 512)            1311232   
_________________________________________________________________
activation_30 (Activation)   (None, 9, 512)            0         
_________________________________________________________________
average_pooling1d_30 (Averag (None, 4, 512)            0         
_________________________________________________________________
flatten_3 (Flatten)          (None, 2048)              0         
_________________________________________________________________
dense_7 (Dense)              (None, 128)               262272    
_________________________________________________________________
dropout_12 (Dropout)         (None, 128)               0         
_________________________________________________________________
dense_8 (Dense)              (None, 32)                4128      
_________________________________________________________________
dense_9 (Dense)              (None, 4)                 132       
=================================================================
Total params: 2,885,124
Trainable params: 2,885,060
Non-trainable params: 64
_________________________________________________________________
