Loss: 0.245
Accuracy: 0.910
F1[A]: 0.8623853211009175
F1[~]: 0.9523809523809523
F1[N]: 0.9413202933985331
F1[O]: 0.8516912402428446
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_1 (Conv1D)            (None, 8998, 32)          128       
_________________________________________________________________
activation_1 (Activation)    (None, 8998, 32)          0         
_________________________________________________________________
batch_normalization_1 (Batch (None, 8998, 32)          128       
_________________________________________________________________
max_pooling1d_1 (MaxPooling1 (None, 4499, 32)          0         
_________________________________________________________________
conv1d_2 (Conv1D)            (None, 4497, 32)          3104      
_________________________________________________________________
activation_2 (Activation)    (None, 4497, 32)          0         
_________________________________________________________________
max_pooling1d_2 (MaxPooling1 (None, 2248, 32)          0         
_________________________________________________________________
conv1d_3 (Conv1D)            (None, 2246, 64)          6208      
_________________________________________________________________
activation_3 (Activation)    (None, 2246, 64)          0         
_________________________________________________________________
max_pooling1d_3 (MaxPooling1 (None, 1123, 64)          0         
_________________________________________________________________
conv1d_4 (Conv1D)            (None, 1121, 64)          12352     
_________________________________________________________________
activation_4 (Activation)    (None, 1121, 64)          0         
_________________________________________________________________
max_pooling1d_4 (MaxPooling1 (None, 560, 64)           0         
_________________________________________________________________
conv1d_5 (Conv1D)            (None, 558, 128)          24704     
_________________________________________________________________
activation_5 (Activation)    (None, 558, 128)          0         
_________________________________________________________________
max_pooling1d_5 (MaxPooling1 (None, 279, 128)          0         
_________________________________________________________________
conv1d_6 (Conv1D)            (None, 277, 128)          49280     
_________________________________________________________________
activation_6 (Activation)    (None, 277, 128)          0         
_________________________________________________________________
max_pooling1d_6 (MaxPooling1 (None, 138, 128)          0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 138, 128)          0         
_________________________________________________________________
conv1d_7 (Conv1D)            (None, 136, 256)          98560     
_________________________________________________________________
activation_7 (Activation)    (None, 136, 256)          0         
_________________________________________________________________
max_pooling1d_7 (MaxPooling1 (None, 68, 256)           0         
_________________________________________________________________
conv1d_8 (Conv1D)            (None, 66, 256)           196864    
_________________________________________________________________
activation_8 (Activation)    (None, 66, 256)           0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 16896)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 128)               2162816   
_________________________________________________________________
dropout_2 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 32)                4128      
_________________________________________________________________
dense_3 (Dense)              (None, 4)                 132       
=================================================================
Total params: 2,558,404
Trainable params: 2,558,340
Non-trainable params: 64
_________________________________________________________________
