Loss: 0.508
Accuracy: 0.843
F1[A]: 0.8131868131868132
F1[~]: 0.6917293233082706
F1[N]: 0.9010101010101011
F1[O]: 0.738970588235294
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_41 (Conv1D)           (None, 8996, 32)          192       
_________________________________________________________________
activation_41 (Activation)   (None, 8996, 32)          0         
_________________________________________________________________
batch_normalization_5 (Batch (None, 8996, 32)          128       
_________________________________________________________________
average_pooling1d_37 (Averag (None, 4498, 32)          0         
_________________________________________________________________
conv1d_42 (Conv1D)           (None, 4494, 32)          5152      
_________________________________________________________________
activation_42 (Activation)   (None, 4494, 32)          0         
_________________________________________________________________
average_pooling1d_38 (Averag (None, 2247, 32)          0         
_________________________________________________________________
conv1d_43 (Conv1D)           (None, 2243, 64)          10304     
_________________________________________________________________
activation_43 (Activation)   (None, 2243, 64)          0         
_________________________________________________________________
average_pooling1d_39 (Averag (None, 1121, 64)          0         
_________________________________________________________________
conv1d_44 (Conv1D)           (None, 1117, 64)          20544     
_________________________________________________________________
activation_44 (Activation)   (None, 1117, 64)          0         
_________________________________________________________________
average_pooling1d_40 (Averag (None, 558, 64)           0         
_________________________________________________________________
conv1d_45 (Conv1D)           (None, 554, 128)          41088     
_________________________________________________________________
activation_45 (Activation)   (None, 554, 128)          0         
_________________________________________________________________
average_pooling1d_41 (Averag (None, 277, 128)          0         
_________________________________________________________________
conv1d_46 (Conv1D)           (None, 273, 128)          82048     
_________________________________________________________________
activation_46 (Activation)   (None, 273, 128)          0         
_________________________________________________________________
average_pooling1d_42 (Averag (None, 136, 128)          0         
_________________________________________________________________
dropout_17 (Dropout)         (None, 136, 128)          0         
_________________________________________________________________
conv1d_47 (Conv1D)           (None, 132, 256)          164096    
_________________________________________________________________
activation_47 (Activation)   (None, 132, 256)          0         
_________________________________________________________________
average_pooling1d_43 (Averag (None, 66, 256)           0         
_________________________________________________________________
conv1d_48 (Conv1D)           (None, 62, 256)           327936    
_________________________________________________________________
activation_48 (Activation)   (None, 62, 256)           0         
_________________________________________________________________
average_pooling1d_44 (Averag (None, 31, 256)           0         
_________________________________________________________________
dropout_18 (Dropout)         (None, 31, 256)           0         
_________________________________________________________________
conv1d_49 (Conv1D)           (None, 27, 512)           655872    
_________________________________________________________________
activation_49 (Activation)   (None, 27, 512)           0         
_________________________________________________________________
average_pooling1d_45 (Averag (None, 13, 512)           0         
_________________________________________________________________
dropout_19 (Dropout)         (None, 13, 512)           0         
_________________________________________________________________
conv1d_50 (Conv1D)           (None, 9, 512)            1311232   
_________________________________________________________________
activation_50 (Activation)   (None, 9, 512)            0         
_________________________________________________________________
flatten_5 (Flatten)          (None, 4608)              0         
_________________________________________________________________
dense_13 (Dense)             (None, 128)               589952    
_________________________________________________________________
dropout_20 (Dropout)         (None, 128)               0         
_________________________________________________________________
dense_14 (Dense)             (None, 32)                4128      
_________________________________________________________________
dense_15 (Dense)             (None, 4)                 132       
=================================================================
Total params: 3,212,804
Trainable params: 3,212,740
Non-trainable params: 64
_________________________________________________________________
