Loss: 0.530
Accuracy: 0.791
F1[A]: 0.7238095238095238
F1[~]: 0.5857142857142857
F1[N]: 0.8827852998065764
F1[O]: 0.594535519125683
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_51 (Conv1D)           (None, 8996, 32)          192       
_________________________________________________________________
activation_51 (Activation)   (None, 8996, 32)          0         
_________________________________________________________________
max_pooling1d_46 (MaxPooling (None, 4498, 32)          0         
_________________________________________________________________
conv1d_52 (Conv1D)           (None, 4494, 32)          5152      
_________________________________________________________________
activation_52 (Activation)   (None, 4494, 32)          0         
_________________________________________________________________
max_pooling1d_47 (MaxPooling (None, 2247, 32)          0         
_________________________________________________________________
conv1d_53 (Conv1D)           (None, 2243, 32)          5152      
_________________________________________________________________
activation_53 (Activation)   (None, 2243, 32)          0         
_________________________________________________________________
max_pooling1d_48 (MaxPooling (None, 1121, 32)          0         
_________________________________________________________________
conv1d_54 (Conv1D)           (None, 1117, 32)          5152      
_________________________________________________________________
activation_54 (Activation)   (None, 1117, 32)          0         
_________________________________________________________________
max_pooling1d_49 (MaxPooling (None, 558, 32)           0         
_________________________________________________________________
conv1d_55 (Conv1D)           (None, 554, 32)           5152      
_________________________________________________________________
activation_55 (Activation)   (None, 554, 32)           0         
_________________________________________________________________
max_pooling1d_50 (MaxPooling (None, 277, 32)           0         
_________________________________________________________________
conv1d_56 (Conv1D)           (None, 273, 32)           5152      
_________________________________________________________________
activation_56 (Activation)   (None, 273, 32)           0         
_________________________________________________________________
max_pooling1d_51 (MaxPooling (None, 136, 32)           0         
_________________________________________________________________
dropout_16 (Dropout)         (None, 136, 32)           0         
_________________________________________________________________
conv1d_57 (Conv1D)           (None, 132, 32)           5152      
_________________________________________________________________
activation_57 (Activation)   (None, 132, 32)           0         
_________________________________________________________________
max_pooling1d_52 (MaxPooling (None, 66, 32)            0         
_________________________________________________________________
conv1d_58 (Conv1D)           (None, 62, 32)            5152      
_________________________________________________________________
activation_58 (Activation)   (None, 62, 32)            0         
_________________________________________________________________
max_pooling1d_53 (MaxPooling (None, 31, 32)            0         
_________________________________________________________________
dropout_17 (Dropout)         (None, 31, 32)            0         
_________________________________________________________________
conv1d_59 (Conv1D)           (None, 27, 32)            5152      
_________________________________________________________________
activation_59 (Activation)   (None, 27, 32)            0         
_________________________________________________________________
max_pooling1d_54 (MaxPooling (None, 13, 32)            0         
_________________________________________________________________
dropout_18 (Dropout)         (None, 13, 32)            0         
_________________________________________________________________
conv1d_60 (Conv1D)           (None, 9, 32)             5152      
_________________________________________________________________
activation_60 (Activation)   (None, 9, 32)             0         
_________________________________________________________________
flatten_6 (Flatten)          (None, 288)               0         
_________________________________________________________________
dense_6 (Dense)              (None, 4)                 1156      
=================================================================
Total params: 47,716
Trainable params: 47,716
Non-trainable params: 0
_________________________________________________________________
