Loss: 0.462
Accuracy: 0.844
F1[A]: 0.7696793002915453
F1[~]: 0.6666666666666667
F1[N]: 0.9072821329088739
F1[O]: 0.7423255813953489
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_31 (Conv1D)           (None, 8996, 32)          192       
_________________________________________________________________
activation_31 (Activation)   (None, 8996, 32)          0         
_________________________________________________________________
batch_normalization_4 (Batch (None, 8996, 32)          128       
_________________________________________________________________
average_pooling1d_28 (Averag (None, 4498, 32)          0         
_________________________________________________________________
conv1d_32 (Conv1D)           (None, 4494, 32)          5152      
_________________________________________________________________
activation_32 (Activation)   (None, 4494, 32)          0         
_________________________________________________________________
average_pooling1d_29 (Averag (None, 2247, 32)          0         
_________________________________________________________________
conv1d_33 (Conv1D)           (None, 2243, 64)          10304     
_________________________________________________________________
activation_33 (Activation)   (None, 2243, 64)          0         
_________________________________________________________________
average_pooling1d_30 (Averag (None, 1121, 64)          0         
_________________________________________________________________
conv1d_34 (Conv1D)           (None, 1117, 64)          20544     
_________________________________________________________________
activation_34 (Activation)   (None, 1117, 64)          0         
_________________________________________________________________
average_pooling1d_31 (Averag (None, 558, 64)           0         
_________________________________________________________________
conv1d_35 (Conv1D)           (None, 554, 128)          41088     
_________________________________________________________________
activation_35 (Activation)   (None, 554, 128)          0         
_________________________________________________________________
average_pooling1d_32 (Averag (None, 277, 128)          0         
_________________________________________________________________
conv1d_36 (Conv1D)           (None, 273, 128)          82048     
_________________________________________________________________
activation_36 (Activation)   (None, 273, 128)          0         
_________________________________________________________________
average_pooling1d_33 (Averag (None, 136, 128)          0         
_________________________________________________________________
dropout_13 (Dropout)         (None, 136, 128)          0         
_________________________________________________________________
conv1d_37 (Conv1D)           (None, 132, 256)          164096    
_________________________________________________________________
activation_37 (Activation)   (None, 132, 256)          0         
_________________________________________________________________
average_pooling1d_34 (Averag (None, 66, 256)           0         
_________________________________________________________________
conv1d_38 (Conv1D)           (None, 62, 256)           327936    
_________________________________________________________________
activation_38 (Activation)   (None, 62, 256)           0         
_________________________________________________________________
average_pooling1d_35 (Averag (None, 31, 256)           0         
_________________________________________________________________
dropout_14 (Dropout)         (None, 31, 256)           0         
_________________________________________________________________
conv1d_39 (Conv1D)           (None, 27, 512)           655872    
_________________________________________________________________
activation_39 (Activation)   (None, 27, 512)           0         
_________________________________________________________________
average_pooling1d_36 (Averag (None, 13, 512)           0         
_________________________________________________________________
dropout_15 (Dropout)         (None, 13, 512)           0         
_________________________________________________________________
conv1d_40 (Conv1D)           (None, 9, 512)            1311232   
_________________________________________________________________
activation_40 (Activation)   (None, 9, 512)            0         
_________________________________________________________________
flatten_4 (Flatten)          (None, 4608)              0         
_________________________________________________________________
dense_10 (Dense)             (None, 128)               589952    
_________________________________________________________________
dropout_16 (Dropout)         (None, 128)               0         
_________________________________________________________________
dense_11 (Dense)             (None, 32)                4128      
_________________________________________________________________
dense_12 (Dense)             (None, 4)                 132       
=================================================================
Total params: 3,212,804
Trainable params: 3,212,740
Non-trainable params: 64
_________________________________________________________________
