Loss: 0.465
Accuracy: 0.842
F1[A]: 0.7910447761194029
F1[~]: 0.6346153846153847
F1[N]: 0.9010706638115632
F1[O]: 0.7629204265791631
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_51 (Conv1D)           (None, 8996, 32)          192       
_________________________________________________________________
activation_51 (Activation)   (None, 8996, 32)          0         
_________________________________________________________________
batch_normalization_6 (Batch (None, 8996, 32)          128       
_________________________________________________________________
average_pooling1d_46 (Averag (None, 4498, 32)          0         
_________________________________________________________________
conv1d_52 (Conv1D)           (None, 4494, 32)          5152      
_________________________________________________________________
activation_52 (Activation)   (None, 4494, 32)          0         
_________________________________________________________________
average_pooling1d_47 (Averag (None, 2247, 32)          0         
_________________________________________________________________
conv1d_53 (Conv1D)           (None, 2243, 64)          10304     
_________________________________________________________________
activation_53 (Activation)   (None, 2243, 64)          0         
_________________________________________________________________
average_pooling1d_48 (Averag (None, 1121, 64)          0         
_________________________________________________________________
conv1d_54 (Conv1D)           (None, 1117, 64)          20544     
_________________________________________________________________
activation_54 (Activation)   (None, 1117, 64)          0         
_________________________________________________________________
average_pooling1d_49 (Averag (None, 558, 64)           0         
_________________________________________________________________
conv1d_55 (Conv1D)           (None, 554, 128)          41088     
_________________________________________________________________
activation_55 (Activation)   (None, 554, 128)          0         
_________________________________________________________________
average_pooling1d_50 (Averag (None, 277, 128)          0         
_________________________________________________________________
conv1d_56 (Conv1D)           (None, 273, 128)          82048     
_________________________________________________________________
activation_56 (Activation)   (None, 273, 128)          0         
_________________________________________________________________
average_pooling1d_51 (Averag (None, 136, 128)          0         
_________________________________________________________________
dropout_21 (Dropout)         (None, 136, 128)          0         
_________________________________________________________________
conv1d_57 (Conv1D)           (None, 132, 256)          164096    
_________________________________________________________________
activation_57 (Activation)   (None, 132, 256)          0         
_________________________________________________________________
average_pooling1d_52 (Averag (None, 66, 256)           0         
_________________________________________________________________
conv1d_58 (Conv1D)           (None, 62, 256)           327936    
_________________________________________________________________
activation_58 (Activation)   (None, 62, 256)           0         
_________________________________________________________________
average_pooling1d_53 (Averag (None, 31, 256)           0         
_________________________________________________________________
dropout_22 (Dropout)         (None, 31, 256)           0         
_________________________________________________________________
conv1d_59 (Conv1D)           (None, 27, 512)           655872    
_________________________________________________________________
activation_59 (Activation)   (None, 27, 512)           0         
_________________________________________________________________
average_pooling1d_54 (Averag (None, 13, 512)           0         
_________________________________________________________________
dropout_23 (Dropout)         (None, 13, 512)           0         
_________________________________________________________________
conv1d_60 (Conv1D)           (None, 9, 512)            1311232   
_________________________________________________________________
activation_60 (Activation)   (None, 9, 512)            0         
_________________________________________________________________
flatten_6 (Flatten)          (None, 4608)              0         
_________________________________________________________________
dense_16 (Dense)             (None, 128)               589952    
_________________________________________________________________
dropout_24 (Dropout)         (None, 128)               0         
_________________________________________________________________
dense_17 (Dense)             (None, 32)                4128      
_________________________________________________________________
dense_18 (Dense)             (None, 4)                 132       
=================================================================
Total params: 3,212,804
Trainable params: 3,212,740
Non-trainable params: 64
_________________________________________________________________
